results/runs/ycsb/2026-05-17T10-00-34/redis/load_workload_a.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 09:52:12:116 0 sec: 0 operations; est completion in 0 second 
2026-05-17 09:52:22:019 9 sec: 100000 operations; 10051.26 current ops/sec; [CLEANUP: Count=10, Max=687, Min=41, Avg=119.1, 90=87, 99=687, 99.9=687, 99.99=687] [INSERT: Count=100000, Max=15767, Min=154, Avg=982.38, 90=1275, 99=2269, 99.9=5735, 99.99=14991] 
[OVERALL], RunTime(ms), 9949
[OVERALL], Throughput(ops/sec), 10051.26143330988
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 69
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6935370388983817
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 69
[TOTAL_GC_TIME_%], Time(%), 0.6935370388983817
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 119.1
[CLEANUP], MinLatency(us), 41
[CLEANUP], MaxLatency(us), 687
[CLEANUP], 95thPercentileLatency(us), 687
[CLEANUP], 99thPercentileLatency(us), 687
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 982.37733
[INSERT], MinLatency(us), 154
[INSERT], MaxLatency(us), 15767
[INSERT], 95thPercentileLatency(us), 1442
[INSERT], 99thPercentileLatency(us), 2269
[INSERT], Return=OK, 100000