results/runs/ycsb/2026-05-17T10-00-34/redis/load_workload_f.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-17 09:57:27:134 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 09:57:36:995 9 sec: 100000 operations; 10067.45 current ops/sec; [CLEANUP: Count=10, Max=1485, Min=56, Avg=249.9, 90=206, 99=1485, 99.9=1485, 99.99=1485] [INSERT: Count=100000, Max=39295, Min=125, Avg=969.45, 90=1256, 99=3423, 99.9=11055, 99.99=25103] 
[OVERALL], RunTime(ms), 9933
[OVERALL], Throughput(ops/sec), 10067.451927917044
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 99
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.9966777408637874
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 99
[TOTAL_GC_TIME_%], Time(%), 0.9966777408637874
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 249.9
[CLEANUP], MinLatency(us), 56
[CLEANUP], MaxLatency(us), 1485
[CLEANUP], 95thPercentileLatency(us), 1485
[CLEANUP], 99thPercentileLatency(us), 1485
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 969.45309
[INSERT], MinLatency(us), 125
[INSERT], MaxLatency(us), 39295
[INSERT], 95thPercentileLatency(us), 1496
[INSERT], 99thPercentileLatency(us), 3423
[INSERT], Return=OK, 100000